gh-pages/jupyter/VIM-Binding.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Jupyter에서 VIM 키바인딩 사용하기</title>
<!-- 2018-07-13 Fri 06:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
</head>
<body>
<div id="content">
<h1 class="title">Jupyter에서 VIM 키바인딩 사용하기</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 소개</a></li>
<li><a href="#sec-2">2. 설치 방법</a>
<ul>
<li><a href="#sec-2-1">2.1. jupyter<sub>contrib</sub><sub>nbextensions</sub> 설치</a></li>
<li><a href="#sec-2-2">2.2. jupyter-vim-binding 설치</a></li>
<li><a href="#sec-2-3">2.3. 활성화 하기</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. 항상 vim binding을 활성화할 경우</a></li>
<li><a href="#sec-2-3-2">2.3.2. config 파일로 조정할 경우</a></li>
<li><a href="#sec-2-3-3">2.3.3. 현재 세션에만 적용할 경우</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 참조</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 소개</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Jupyter</b> 는 웹 브라우저에서 코드를 작성 하고 실행 및 문서화를 통해 바로 결과를 확인할 수 있는 장점이 있지만 코드 작성 측면시에는 불편함이 많이 따릅니다.
</p>

<p>
물론 키바인딩이 있지만 하나하나 입맞에 따라 맞추기도 귀찮아 VIM 플러그인을 찾아보았습니다.
</p>

<p>
역시나 에디터가 있는 곳에는 항상 VIM 플러그인이 존재했습니다.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 설치 방법</h2>
<div class="outline-text-2" id="text-2">
<p>
Jupyter는 기본 확장 기능이 없어서 확장 기능부터 먼저 설치해야 합니다.
jupyter가 설치되어 있다고 가정하고 진행합니다.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> jupyter<sub>contrib</sub><sub>nbextensions</sub> 설치</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>pip install jupyter<sub>contrib</sub><sub>nbextensions</sub>
</li>
<li>jupyter contrib nbextension install &#x2013;user
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> jupyter-vim-binding 설치</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>mkdir -p $(jupyter &#x2013;data-dir)/nbextensions/vim<sub>binding</sub>
</li>
<li>jupyter nbextension install <a href="https://raw.githubusercontent.com/lambdalisue/jupyter-vim-binding/master/vim_binding.js">https://raw.githubusercontent.com/lambdalisue/jupyter-vim-binding/master/vim_binding.js</a> &#x2013;nbextensions=$(jupyter &#x2013;data-dir)/nbextensions/vim<sub>binding</sub>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 활성화 하기</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> 항상 vim binding을 활성화할 경우</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>jupyter nbextension enable vim<sub>binding</sub>/vim<sub>binding</sub>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> config 파일로 조정할 경우</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
<code>/nbconfig/notebook.json</code> 파일을 수정합니다.
</p>

<div class="org-src-container">

<pre class="src src-js">{                                
  "load_extensions": {          
    "vim_binding/vim_binding": true
  }                                
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> 현재 세션에만 적용할 경우</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">

<pre class="src src-js">%%javascript
Jupyter.utils.load_extensions('vim_binding/vim_binding');
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 참조</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://github.com/ipython-contrib/jupyter_contrib_nbextensions">jupyter<sub>contrib</sub><sub>nbextensions</sub> - GitHub</a>
</li>
<li><a href="https://github.com/lambdalisue/jupyter-vim-binding">jupyter-vim-binding - GitHub</a>
</li>
<li><a href="https://github.com/lambdalisue/jupyter-vim-binding/wiki/Installation">jupyter-vim-binding 설치 방법</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2018-07-13 Fri 06:33</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
